In [3]:
import numpy as np
import pandas as pd

In [ ]:
dict1={'name':['Gurnoor','Joshua','Hari'],
       'marks':[97,86,75],
       'city':['Delhi','Goa','Varanasi']}
df=pd.DataFrame(dict1) #This basically creates an excel sheet inside python itself

In [6]:
df

      name  marks      city
0  Gurnoor     97     Delhi
1   Joshua     86       Goa
2     Hari     75  Varanasi

In [7]:
#For taking this excel sheet's content into excel itself
df.to_csv('friends.csv')

In [9]:
df.to_csv('friends_no_index.csv',index=False) #This creates csv file without index

In [10]:
df.head(2)

      name  marks   city
0  Gurnoor     97  Delhi
1   Joshua     86    Goa

In [11]:
df.tail(2)

     name  marks      city
1  Joshua     86       Goa
2    Hari     75  Varanasi

In [12]:
df.describe()

       marks
count    3.0
mean    86.0
std     11.0
min     75.0
25%     80.5
50%     86.0
75%     91.5
max     97.0

In [13]:
#On writing .read_csv with the file name the contents of the csv file gets read

In [14]:
df.index=['first','second','third']
df

           name  marks      city
first   Gurnoor     97     Delhi
second   Joshua     86       Goa
third      Hari     75  Varanasi

In [15]:
ser=pd.Series(np.random.rand(34))
ser

0     0.353101
1     0.165588
2     0.728727
3     0.330286
4     0.316042
5     0.241869
6     0.793838
7     0.019160
8     0.246892
9     0.299447
10    0.126052
11    0.907838
12    0.918919
13    0.704517
14    0.436551
15    0.666582
16    0.788634
17    0.787928
18    0.475564
19    0.342301
20    0.722428
21    0.758311
22    0.213613
23    0.035784
24    0.055282
25    0.521907
26    0.595314
27    0.514793
28    0.764582
29    0.153995
30    0.671259
31    0.611440
32    0.547913
33    0.794070
dtype: float64

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
newdef=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [20]:
newdef

            0         1         2         3         4
0    0.540487  0.326558  0.359120  0.350046  0.635693
1    0.140096  0.076584  0.072761  0.846030  0.809980
2    0.806041  0.635002  0.716215  0.274714  0.092815
3    0.271049  0.453517  0.026457  0.256336  0.992762
4    0.299175  0.057343  0.793956  0.973251  0.289114
..        ...       ...       ...       ...       ...
329  0.087226  0.041990  0.658508  0.881255  0.691076
330  0.483579  0.694998  0.565225  0.572385  0.156788
331  0.320626  0.689593  0.691282  0.841320  0.303188
332  0.812029  0.919910  0.326371  0.743703  0.804560
333  0.448232  0.969311  0.774879  0.859652  0.484948

[334 rows x 5 columns]

In [21]:
newdef.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [22]:
newdef.columns

RangeIndex(start=0, stop=5, step=1)

In [24]:
newdef.to_numpy()

array([[0.5404871 , 0.32655773, 0.3591203 , 0.35004643, 0.63569273],
       [0.14009571, 0.07658384, 0.07276145, 0.84602954, 0.80997985],
       [0.80604136, 0.63500241, 0.71621485, 0.27471396, 0.09281535],
       ...,
       [0.32062619, 0.6895934 , 0.69128194, 0.84132035, 0.30318844],
       [0.81202894, 0.91990957, 0.3263714 , 0.74370295, 0.80456042],
       [0.44823234, 0.96931089, 0.77487939, 0.8596522 , 0.48494817]])

In [25]:
newdef.head()

          0         1         2         3         4
0  0.540487  0.326558  0.359120  0.350046  0.635693
1  0.140096  0.076584  0.072761  0.846030  0.809980
2  0.806041  0.635002  0.716215  0.274714  0.092815
3  0.271049  0.453517  0.026457  0.256336  0.992762
4  0.299175  0.057343  0.793956  0.973251  0.289114

In [29]:
# newdef.sort_index(axis=0,ascending=False)
newdef.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.635693  0.350046  0.359120  0.326558  0.540487
1    0.809980  0.846030  0.072761  0.076584  0.140096
2    0.092815  0.274714  0.716215  0.635002  0.806041
3    0.992762  0.256336  0.026457  0.453517  0.271049
4    0.289114  0.973251  0.793956  0.057343  0.299175
..        ...       ...       ...       ...       ...
329  0.691076  0.881255  0.658508  0.041990  0.087226
330  0.156788  0.572385  0.565225  0.694998  0.483579
331  0.303188  0.841320  0.691282  0.689593  0.320626
332  0.804560  0.743703  0.326371  0.919910  0.812029
333  0.484948  0.859652  0.774879  0.969311  0.448232

[334 rows x 5 columns]